import React from 'react';
import classes from "./Navbar.module.css"
import {NavLink} from "react-router-dom";

const Navbar = (props) => {
    return (
        <>
            <nav>
                <div className={classes.nav__list}>
                    <NavLink to="/warehouse" className={({isActive}) =>
                        isActive ? classes.active : undefined}>
                        <svg width="24" height="24" viewBox="0 0 24 24" fill="none"
                             xmlns="http://www.w3.org/2000/svg">
                            <path
                                d="M22.2 5.2C21.7 4.6 21 4.2 20.2 4.2H5.9L5.7 3.8C5.2 2.1 3.7 1 2 1C1.4 1 1 1.4 1 2C1 2.6 1.4 3 2 3C2.8 3 3.6 3.6 3.8 4.4L4.5 6.7L6.7 13.8C7.2 15.6 8.8 16.8 10.7 16.8H17.3C19.3 16.8 20.9 15.4 21.4 13.5L22.8 7.4C22.9 6.7 22.7 5.9 22.2 5.2Z"
                                fill="#DADEE5"/>
                            <path
                                d="M9.8998 23C11.3357 23 12.4998 21.8359 12.4998 20.4C12.4998 18.9641 11.3357 17.8 9.8998 17.8C8.46386 17.8 7.2998 18.9641 7.2998 20.4C7.2998 21.8359 8.46386 23 9.8998 23Z"
                                fill="#DADEE5"/>
                            <path
                                d="M17.8002 23C19.2361 23 20.4002 21.8359 20.4002 20.4C20.4002 18.9641 19.2361 17.8 17.8002 17.8C16.3643 17.8 15.2002 18.9641 15.2002 20.4C15.2002 21.8359 16.3643 23 17.8002 23Z"
                                fill="#DADEE5"/>
                        </svg>
                        <span>Склад</span>
                    </NavLink>
                    {/* склад */}
                    <NavLink to="/stats" className={({isActive}) =>
                        isActive ? classes.active : undefined}>
                        <svg width="24" height="24" viewBox="0 0 24 24" fill="none"
                             xmlns="http://www.w3.org/2000/svg">
                            <path fill-rule="evenodd" clip-rule="evenodd"
                                  d="M7.50009 6C7.50009 3.51472 9.51481 1.5 12.0001 1.5C14.4854 1.5 16.5001 3.51472 16.5001 6C16.5001 8.48528 14.4854 10.5 12.0001 10.5C9.51481 10.5 7.50009 8.48528 7.50009 6Z"
                                  fill="#DADEE5"/>
                            <path fill-rule="evenodd" clip-rule="evenodd"
                                  d="M3.75133 20.1053C3.82867 15.6156 7.49207 12 12.0001 12C16.5082 12 20.1717 15.6157 20.2488 20.1056C20.254 20.4034 20.0824 20.676 19.8117 20.8002C17.4328 21.8918 14.7866 22.5 12.0004 22.5C9.21395 22.5 6.56752 21.8917 4.18841 20.7999C3.91774 20.6757 3.7462 20.4031 3.75133 20.1053Z"
                                  fill="#DADEE5"/>
                        </svg>
                        <span>Личная статистика</span>
                    </NavLink>
                    {/* статистика */}
                    <NavLink to="/services" className={({isActive}) =>
                        isActive ? classes.active : undefined}>
                        <svg width="24" height="24" viewBox="0 0 24 24" fill="none"
                             xmlns="http://www.w3.org/2000/svg">
                            <path
                                d="M16.3 5H7.7C4 5 1 8 1 11.7C1 15.4 4 18.4 7.7 18.4H16.3C20 18.4 23 15.4 23 11.7C23 8 20 5 16.3 5Z"
                                fill="#DADEE6"/>
                            <path
                                d="M16.3 14.7C17.9569 14.7 19.3 13.3569 19.3 11.7C19.3 10.0432 17.9569 8.70001 16.3 8.70001C14.6432 8.70001 13.3 10.0432 13.3 11.7C13.3 13.3569 14.6432 14.7 16.3 14.7Z"
                                fill="white"/>
                        </svg>
                        <span>Доп.Услуги</span>
                    </NavLink>
                    {/* услуги */}
                    <NavLink to="/loyalty" className={({isActive}) =>
                        isActive ? classes.active : undefined}>
                        <svg width="24" height="24" viewBox="0 0 24 24" fill="none"
                             xmlns="http://www.w3.org/2000/svg">
                            <path fill-rule="evenodd" clip-rule="evenodd"
                                  d="M8.25 6.75C8.25 4.67893 9.92893 3 12 3C14.0711 3 15.75 4.67893 15.75 6.75C15.75 8.82107 14.0711 10.5 12 10.5C9.92893 10.5 8.25 8.82107 8.25 6.75Z"
                                  fill="#DADEE5"/>
                            <path fill-rule="evenodd" clip-rule="evenodd"
                                  d="M15.75 9.75C15.75 8.09315 17.0931 6.75 18.75 6.75C20.4069 6.75 21.75 8.09315 21.75 9.75C21.75 11.4069 20.4069 12.75 18.75 12.75C17.0931 12.75 15.75 11.4069 15.75 9.75Z"
                                  fill="#DADEE5"/>
                            <path fill-rule="evenodd" clip-rule="evenodd"
                                  d="M2.25 9.75C2.25 8.09315 3.59315 6.75 5.25 6.75C6.90685 6.75 8.25 8.09315 8.25 9.75C8.25 11.4069 6.90685 12.75 5.25 12.75C3.59315 12.75 2.25 11.4069 2.25 9.75Z"
                                  fill="#DADEE5"/>
                            <path fill-rule="evenodd" clip-rule="evenodd"
                                  d="M6.30986 15.1175C7.50783 13.2444 9.60835 12 12 12C14.3919 12 16.4927 13.2447 17.6906 15.1182C18.5187 16.4134 18.877 17.9752 18.709 19.4979C18.6827 19.7359 18.5444 19.947 18.3368 20.0662C16.4694 21.1376 14.3051 21.75 12 21.75C9.69492 21.75 7.53059 21.1376 5.66325 20.0662C5.45559 19.947 5.3173 19.7359 5.29103 19.4979C5.12293 17.9749 5.48141 16.4129 6.30986 15.1175Z"
                                  fill="#DADEE5"/>
                            <path
                                d="M5.08228 14.2537C5.07024 14.2722 5.05827 14.2907 5.04638 14.3093C4.08091 15.8189 3.63908 17.6167 3.77471 19.389C3.16667 19.2967 2.5767 19.1481 2.01043 18.9487L1.89547 18.9082C1.68576 18.8343 1.53923 18.6439 1.52159 18.4222L1.51192 18.3007C1.50402 18.2014 1.5 18.1011 1.5 18C1.5 15.9851 3.08905 14.3414 5.08228 14.2537Z"
                                fill="#DADEE5"/>
                            <path
                                d="M20.2256 19.389C20.3612 17.617 19.9196 15.8196 18.9545 14.3102C18.9424 14.2913 18.9303 14.2725 18.9181 14.2537C20.9111 14.3416 22.5 15.9853 22.5 18C22.5 18.1011 22.496 18.2014 22.4881 18.3007L22.4784 18.4222C22.4608 18.6439 22.3142 18.8343 22.1045 18.9082L21.9896 18.9487C21.4234 19.1481 20.8336 19.2966 20.2256 19.389Z"
                                fill="#DADEE5"/>
                        </svg>
                        <span>Программа лояльности</span>
                    </NavLink>
                    {/* лояльность */}
                </div>
            </nav>
        </>
    );
};

export default Navbar;